C09/Nz25/Nz25_ref/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

theta  	15;

rad_theta	#calc "degToRad($theta)";
sin_theta	#calc "sin($rad_theta)";
cos_theta	#calc "cos($rad_theta)";

gx		#calc "9.81 * $sin_theta";
gz		#calc "-9.81 * $cos_theta";


dimensions      [0 1 -2 0 0 0 0];
value           ($gx 0 $gz);


// ************************************************************************* //
